# Guided Project: Answering Business Questions Using SQL

# Introduction and Schema Diagram

In this guided project, we're going to practice using our SQL skills to answer business questions.

We'll continue to use the Chinook database that we've used in earlier lessons of this course. The Chinook database is provided as a SQLite database file called `chinook.db`. A copy of the database schema is below:

![](https://s3.amazonaws.com/dq-content/191/chinook-schema.svg)

It's worth remembering that our database retains 'state', so if we run a query with a `CREATE` or `DROP` twice, the query will fail. If you have trouble, or if you manage to lock your database, we have provided a `chinook-unmodified.db` file that you can copy over the `chinook.db` to restore it back to its initial state (see [this blog post](https://www.dataquest.io/blog/jupyter-notebook-tips-tricks-shortcuts/?_gl=1*1h07hls*_gcl_aw*R0NMLjE2NzM5MjAyMzIuRUFJYUlRb2JDaE1JOXRlNTVJNzMtUUlWcWlaTUNoMXJGd0pWRUFBWUFTQUFFZ0xfN19EX0J3RQ..#17executingshellcommands) on how to run shell commands within a Jupyter notebook).

In [1]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

'Connected: None@chinook.db'

In [2]:
! ls -Ahl

total 2.1M
-rwxrwxrwx 1 dq root  45K Jan 20 03:37 Basics.ipynb
-rwxrwxrwx 1 dq root 1.1M Jan 20 03:25 chinook.db
-rwxrwxrwx 1 dq root 1.1M Jan  1  1970 chinook-unmodified.db
drwxr-xr-x 2 dq root 4.0K Jan 17 03:50 .ipynb_checkpoints

## Overview of the Data

In [3]:
%%sql

SELECT
    name,
    type
FROM sqlite_master
WHERE type IN ("table","view");

Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table'),
 ('album_track_book', 'view'),
 ('invoiced_tracks', 'view'),
 ('invoice_type', 'view')]

In [4]:
%%sql

SELECT * 
    FROM customer
    LIMIT 10;

Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4),
 (6, 'Helena', 'Holý', None, 'Rilská 3174/6', 'Prague', None, 'Czech Republic', '14300', '+420 2 4177 0449', None, 'hholy@gmail.com', 5),
 (7, 'Astrid', 'Gruber', None, 'Rotenturmstraße 4, 1010 Innere Stadt', 'Vienne', None, 'Austria', '1010', '+43 01 5134505', None, 'astrid.gruber@apple.at', 5),
 (8, 'Daan', 'Peeters', None, 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', '+32 02 219 03 03', None, 'daan_peeters@apple.be', 4),
 (9, 'Kara', 'Nielsen', None, 'Sønder Boulevard 51', 'Copenhagen', None, 'Denmark', '1720', '+453 3331 9991', None, 'kara.nielsen@jubii.dk', 4),
 (10, 'Eduardo', 'Martins', 'Woodstock Discos', 'Rua Dr. Falcão Filho, 155', 'São Paulo', 'SP', 'Brazil', '01007-010', '+55 (11) 3033-5446', '+55 (11) 3033-4564', 'eduardo@woodstock.com.br', 4)]

In [5]:
%%sql

SELECT * 
    FROM invoice
    LIMIT 10;

Done.

[(1, 18, '2017-01-03 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 15.84),
 (2, 30, '2017-01-03 00:00:00', '230 Elgin Street', 'Ottawa', 'ON', 'Canada', 'K2P 1L7', 9.9),
 (3, 40, '2017-01-05 00:00:00', '8, Rue Hanovre', 'Paris', 'None', 'France', '75002', 1.98),
 (4, 18, '2017-01-06 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 7.92),
 (5, 27, '2017-01-07 00:00:00', '1033 N Park Ave', 'Tucson', 'AZ', 'USA', '85719', 16.83),
 (6, 31, '2017-01-10 00:00:00', '194A Chain Lake Drive', 'Halifax', 'NS', 'Canada', 'B3S 1C5', 1.98),
 (7, 49, '2017-01-12 00:00:00', 'Ordynacka 10', 'Warsaw', 'None', 'Poland', '00-358', 10.89),
 (8, 59, '2017-01-13 00:00:00', '3,Raj Bhavan Road', 'Bangalore', 'None', 'India', '560001', 9.9),
 (9, 18, '2017-01-18 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 8.91),
 (10, 31, '2017-01-18 00:00:00', '194A Chain Lake Drive', 'Halifax', 'NS', 'Canada', 'B3S 1C5', 1.98)]

## Selecting Albums to Purchase

The Chinook record store has just signed a deal with a new record label, and you've been tasked with selecting the first three albums that will be added to the store, from a list of four. All four albums are by artists that don't have any tracks in the store right now - we have the artist names, and the genre of music they produce:

|Artist Name|Genre|
|-----------|------------|
|Regal|Hip-Hop|
|Red Tone|Punk|
|Meteor and the Girls|Pop|
|Slim Jim Bites|Blues|

The record label specializes in artists from the USA, and they have given Chinook some money to advertise the new albums in the USA, so we're interested in finding out **which genres sell the best in the USA**.

You'll need to write a query to find out which genres sell the most tracks in the USA, write up a summary of your findings, and make a recommendation for the three artists whose albums we should purchase for the store.

1. Write a query that returns each genre, with the number of tracks sold in the USA:
    * in absolute numbers
    * in percentages.
2. Write a paragraph that interprets the data and makes a recommendation for the three artists whose albums we should purchase for the store, based on sales of tracks from their genres.

In [6]:
%%sql

WITH sales AS (
SELECT 
    i.billing_country country,
    t.name track,
    g.name genre
    
FROM invoice i
INNER JOIN invoice_line il ON i.invoice_id = il.invoice_id
INNER JOIN track t ON il.track_id = t.track_id
INNER JOIN genre g ON t.genre_id = g.genre_id
)

SELECT 
    genre,
    COUNT(track) track_sold,
    ROUND(CAST(COUNT(track) AS Float)/(SELECT COUNT(track) FROM sales WHERE country = 'USA')*100, 2) percentage
    
FROM sales
WHERE country = 'USA'
GROUP BY 1
ORDER BY 2 DESC;

Done.

[('Rock', 561, 53.38),
 ('Alternative & Punk', 130, 12.37),
 ('Metal', 124, 11.8),
 ('R&B/Soul', 53, 5.04),
 ('Blues', 36, 3.43),
 ('Alternative', 35, 3.33),
 ('Latin', 22, 2.09),
 ('Pop', 22, 2.09),
 ('Hip Hop/Rap', 20, 1.9),
 ('Jazz', 14, 1.33),
 ('Easy Listening', 13, 1.24),
 ('Reggae', 6, 0.57),
 ('Electronica/Dance', 5, 0.48),
 ('Classical', 4, 0.38),
 ('Heavy Metal', 3, 0.29),
 ('Soundtrack', 2, 0.19),
 ('TV Shows', 1, 0.1)]

So based on the ranking of popular genres, we should suggest the following artists in order:

1. Red Tone, Punk
2. Slim Jim Bites, Blues
3. Meteor and the Girls, Pop

The sales for rock genre, however, were so overwhelming (over one half) compared to other genres.

## Analyzing Employee Sales Performance

Each customer for the Chinook store gets assigned to a sales support agent within the company when they first make a purchase. You have been asked to analyze the purchases of customers belonging to each employee to see if any sales support agent is performing either better or worse than the others.

You might like to consider whether any extra columns from the employee table explain any variance you see, or whether the variance might instead be indicative of employee performance.

1. Write a query that finds the total dollar amount of sales assigned to each sales support agent within the company. Add any extra attributes for that employee that you find are relevant to the analysis.
2. Write a short statement describing your results, and providing a possible interpretation

In [7]:
%%sql 

SELECT

e.employee_id, 
e.last_name ||', '|| e.first_name name,
e.title, 
e.hire_date,
ROUND(SUM(i.total)) total_sales

FROM employee e
LEFT JOIN customer c ON e.employee_id = c.support_rep_id
LEFT JOIN invoice i ON c.customer_id = i.customer_id
GROUP BY 1
ORDER BY total_sales DESC;

Done.

[(3, 'Peacock, Jane', 'Sales Support Agent', '2017-04-01 00:00:00', 1732.0),
 (4, 'Park, Margaret', 'Sales Support Agent', '2017-05-03 00:00:00', 1584.0),
 (5, 'Johnson, Steve', 'Sales Support Agent', '2017-10-17 00:00:00', 1394.0),
 (1, 'Adams, Andrew', 'General Manager', '2016-08-14 00:00:00', None),
 (2, 'Edwards, Nancy', 'Sales Manager', '2016-05-01 00:00:00', None),
 (6, 'Mitchell, Michael', 'IT Manager', '2016-10-17 00:00:00', None),
 (7, 'King, Robert', 'IT Staff', '2017-01-02 00:00:00', None),
 (8, 'Callahan, Laura', 'IT Staff', '2017-03-04 00:00:00', None)]

It can be seen that employees that were IT staff and managers were not involved with sales and customers. The sales from the three sales support agents were not greatly different. Apparently, Jane had the largest quantities of sales likely due to she was hire earlier than others.

## Analyzing Sales by Country

Your next task is to analyze the sales data for customers from each different country. You have been given guidance to use the country value from the `customers` table, and ignore the country from the billing address in the `invoice` table.

In particular, you have been directed to calculate data, for each country, on the:

* total number of customers
* total value of sales
* average value of sales per customer
* average order value

Because there are a number of countries with only one customer, you should group these customers as "Other" in your analysis. You can use the following 'trick' to force the ordering of "Other" to last in your analysis.

If there is a particular value that you would like to force to the top or bottom of results, you can put what would normally be your most outer query in a subquery with a case statement that adds a numeric column, and then in the outer query sort by that column.

You should be able to adapt this technique into your query to force 'Other' to the bottom of your results. When working through this exercise, you will need multiple subqueries and joins. Imagine you work on a team of data analysts, and write your query so that it will be able to be easily read and understood by your colleagues.

Write a query that collates data on purchases from different countries.

* Where a country has only one customer, collect them into an "Other" group.
* The results should be sorted by the total sales from highest to lowest, with the "Other" group at the very bottom.
* For each country, include:
    * total number of customers
    * total value of sales
    * average value of sales per customer
    * average order value

In [8]:
%%sql

WITH country_map AS (
SELECT 
    country,
    COUNT(*) num_customers,
    CASE 
        WHEN COUNT(*) > 1 THEN country
        ELSE 'Others'
        END AS country_updt

FROM customer
GROUP BY 1), 

customer_updt AS (
SELECT 
    c.*,
    cm.country_updt
FROM customer c
INNER JOIN country_map cm ON c.country = cm.country
),

sales AS (SELECT 
    cu.country_updt country,
    COUNT(DISTINCT cu.customer_id) num_customers,
    SUM(i.total) total_sales,
    SUM(i.total)/COUNT(DISTINCT cu.customer_id) average_sales_per_customer,
    AVG(i.total) average_order_value,
    CASE 
        WHEN cu.country_updt = 'Others' THEN 1
        ELSE 0
        END AS sort

FROM customer_updt cu
INNER JOIN invoice i ON cu.customer_id = i.customer_id
GROUP BY 1)

SELECT 
    country, 
    num_customers, 
    total_sales, 
    average_sales_per_customer, 
    average_order_value

FROM sales
ORDER BY sort, total_sales DESC;

Done.

[('USA', 13, 1040.4899999999998, 80.0376923076923, 7.942671755725189),
 ('Canada', 8, 535.5900000000001, 66.94875000000002, 7.047236842105265),
 ('Brazil', 5, 427.68000000000006, 85.53600000000002, 7.0111475409836075),
 ('France', 5, 389.0699999999999, 77.81399999999998, 7.781399999999998),
 ('Germany', 4, 334.62, 83.655, 8.161463414634147),
 ('Czech Republic', 2, 273.24000000000007, 136.62000000000003, 9.108000000000002),
 ('United Kingdom', 3, 245.52, 81.84, 8.768571428571429),
 ('Portugal', 2, 185.13000000000002, 92.56500000000001, 6.383793103448276),
 ('India', 2, 183.14999999999998, 91.57499999999999, 8.72142857142857),
 ('Others', 15, 1094.9400000000003, 72.99600000000002, 7.44857142857143)]

It is interesting to note that there are four countries

* Czech Republic
* United Kingdom
* Portugal
* India

that have relatively low total sales as of the moment, but they tend to have a larger value for average sales per customer or per order.

## Albums vs Individual Tracks

1. Write a query that categorizes each invoice as either an album purchase or not, and calculates the following summary statistics:

    * Number of invoices
    * Percentage of invoices

2. Write one to two sentences explaining your findings, and making a prospective recommendation on whether the Chinook store should continue to buy full albums from record companies

Up until now, we've only ever compared two single values, using operators like `=` `!=` and `LIKE`. To compare two tables of value, we can use the `EXCEPT` operator that we learned in the previous lesson.

![](https://s3.amazonaws.com/dq-content/191/compare_example_4.svg)

In [9]:
%%sql

DROP VIEW IF EXISTS album_track_book;

CREATE VIEW album_track_book AS 

SELECT 
    a.album_id, 
    t.track_id
    
FROM album a 
LEFT JOIN track t ON a.album_id = t.album_id
;

Done.
Done.

[]

In [10]:
%%sql

DROP VIEW IF EXISTS invoiced_tracks;

CREATE VIEW invoiced_tracks AS
SELECT 
    il.invoice_id,
    t.album_id,
    t.track_id
FROM invoice_line il 
LEFT JOIN track t ON il.track_id = t.track_id;

Done.
Done.

[]

In [11]:
%%sql

DROP VIEW IF EXISTS invoice_type;

CREATE VIEW invoice_type AS
SELECT 

    invoice_id, 
    album_id,
    COUNT(DISTINCT album_id) AS num_albums

FROM invoiced_tracks
GROUP BY invoice_id;

Done.
Done.

[]

In [12]:
%%sql

WITH single_album_purchase AS(
SELECT
    ity.invoice_id,
    CASE 
    WHEN 
        (SELECT  
              itr.track_id
        FROM invoiced_tracks itr
        WHERE itr.invoice_id = ity.invoice_id 
        EXCEPT
        SELECT 
              atb.track_id 
        FROM album_track_book atb
        WHERE atb.album_id = ity.album_id) IS NULL
        
        AND
        
        (SELECT 
              atb.track_id 
        FROM album_track_book atb
        WHERE atb.album_id = ity.album_id 
        EXCEPT
        SELECT 
              itr.track_id
        FROM invoiced_tracks itr
        WHERE itr.invoice_id = ity.invoice_id) IS NULL
        
        
    THEN 'by_album'
    ELSE 'by_track'
    END AS order_type
    
FROM invoice_type ity
WHERE ity.num_albums = 1
GROUP BY ity.invoice_id
),

invoice_type_new AS (
SELECT
    ity.invoice_id, 
    CASE WHEN num_albums > 1 THEN 'by_track'
    ELSE sap.order_type 
    END AS order_type
    
FROM invoice_type ity
LEFT JOIN single_album_purchase sap ON ity.invoice_id = sap.invoice_id
)

SELECT 
    order_type,
    COUNT(*) counts,
    ROUND(CAST(COUNT(*) AS Float)/(SELECT COUNT(*) FROM invoice_type_new)*100, 2) percentage

FROM invoice_type_new
GROUP BY order_type
;

Done.

[('by_album', 114, 18.57), ('by_track', 500, 81.43)]

It can be observed that most purchases consisted of individual tracks that did not originate from a full album or alternatively came from multiple albums.